# Reset Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilteredElementIterator..::..Reset Method
FilteredElementIterator Class See Also
---
Resets the iterator to the beginning.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public virtual void Reset()
```

Visual Basic
---
```text
Public Overridable Sub Reset
```

Visual C++
---
```text
public:
virtual void Reset()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The FilteredElementCollector that yielded this iterator has been reset by another operation. No further iteration is permitted with this iterator. |

# See Also
FilteredElementIterator Class
Autodesk.Revit.DB Namespace